In [26]:
import pandas as pd
from sklearn import preprocessing

df = pd.read_csv('https://raw.githubusercontent.com/amandamichelle27/IS362_assignment7/master/movie-data.csv', index_col="Name")
df

,Jumanji,Star Wars: The Last Jedi,Peter Rabbit,The Black Panther,The Shape of Water
Name,,,,,
Jon,4.0,3.0,3.0,5.0,NaN
Becca,3.0,NaN,3.0,5.0,NaN
Jesse,3.0,NaN,2.0,5.0,NaN
Ash,NaN,4.0,NaN,NaN,4.0
Cezar,NaN,4.0,NaN,NaN,3.0

In [27]:
df.mean(axis=1)

Name
Jon      3.750000
Becca    3.666667
Jesse    3.333333
Ash      4.000000
Cezar    3.500000
dtype: float64

In [28]:
df.mean()

Jumanji                     3.333333
Star Wars: The Last Jedi    3.666667
Peter Rabbit                2.666667
The Black Panther           5.000000
The Shape of Water          3.500000
dtype: float64

In [51]:
normalized_data = df.subtract(df.min(axis=1), axis=0).divide(df.max(axis=1) - df.min(axis=1) + 1E-6, axis=0).round(2)
normalized_data

,Jumanji,Star Wars: The Last Jedi,Peter Rabbit,The Black Panther,The Shape of Water
Name,,,,,
Jon,0.50,0.0,0.0,1.0,NaN
Becca,0.00,NaN,0.0,1.0,NaN
Jesse,0.33,NaN,0.0,1.0,NaN
Ash,NaN,0.0,NaN,NaN,0.0
Cezar,NaN,1.0,NaN,NaN,0.0

In [53]:
normalized_data.mean(axis=1)

Name
Jon      0.375000
Becca    0.333333
Jesse    0.443333
Ash      0.000000
Cezar    0.500000
dtype: float64

In [52]:
normalized_data.mean()

Jumanji                     0.276667
Star Wars: The Last Jedi    0.333333
Peter Rabbit                0.000000
The Black Panther           1.000000
The Shape of Water          0.000000
dtype: float64